content.org/posts/google-gfs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-09 Sat 11:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>"Google File System"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="adam" />
</head>
<body>
<div id="content">
<h1 class="title">"Google File System"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdef8944">1. 5.1 High Availability</a>
<ul>
<li><a href="#org0f73da6">1.1. Chunk Replication</a></li>
<li><a href="#org15c29e3">1.2. Master Replication</a></li>
</ul>
</li>
<li><a href="#orgb0739fe">2. 5.2 Data Integrity</a></li>
<li><a href="#org80c9151">3. 6 Measurements</a></li>
<li><a href="#org58a310b">4. 6.1.1 Reads</a></li>
<li><a href="#orga1a0488">5. 6.1.2 Writes</a></li>
<li><a href="#orge255c21">6. 6.1.3 Appends</a></li>
<li><a href="#org92da799">7. 6.2.4 Master Load</a></li>
<li><a href="#org8ef8a47">8. 6.2.5 Recovery time</a></li>
<li><a href="#org30ae72e">9. 6.3.2 Chuckserver Workload</a>
<ul>
<li><a href="#orge726718">9.1. Bimodal</a></li>
</ul>
</li>
<li><a href="#org0213f30">10. 6.3.3 Appends vs Writes</a></li>
<li><a href="#orga488e8a">11. 6.3.4 Master Workload</a></li>
<li><a href="#org108ddfd">12. 7 Experiences</a>
<ul>
<li><a href="#orgffa718e">12.1. RW lock</a></li>
</ul>
</li>
<li><a href="#orgade7f9d">13. Summary</a>
<ul>
<li><a href="#orga237fd9">13.1. design space</a></li>
<li><a href="#org84a9dad">13.2. fault tolerance</a></li>
<li><a href="#org5bf5c67">13.3. high throughput</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdef8944" class="outline-2">
<h2 id="orgdef8944"><span class="section-number-2">1</span> 5.1 High Availability</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0f73da6" class="outline-3">
<h3 id="org0f73da6"><span class="section-number-3">1.1</span> Chunk Replication</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>RF of 3</li>
<li>master clones existing replicas when chunkservers go offline or detect
corrupted replicas</li>
</ul>
</div>
</div>
<div id="outline-container-org15c29e3" class="outline-3">
<h3 id="org15c29e3"><span class="section-number-3">1.2</span> Master Replication</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>operation log and checkpoints replicas</li>
<li>"shadow" masters provide read-only access
<ul class="org-ul">
<li>file metadata like directory contest could be stale</li>
<li>reads replica information from logs</li>
<li>pools from chunkservers to locate chunk replicas</li>
<li>depends on primary for decisions to create and delete replicas</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb0739fe" class="outline-2">
<h2 id="orgb0739fe"><span class="section-number-2">2</span> 5.2 Data Integrity</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>impractical to very replica data between replicas</li>
<li>use 32bit checksum on 64KB blocks
<ul class="org-ul">
<li>stored persistently with logging and separate from user data</li>
</ul></li>
<li>in reads:
<ul class="org-ul">
<li>chunkserver verifies the checksum before returning data</li>
<li>client reads from another replica</li>
<li>master creates a different replica and delete the corrupted one</li>
</ul></li>
<li>in appends:
<ul class="org-ul">
<li>incrementally update the checksum for last partial checksum blocks</li>
<li>even if last partial checksum is corrupted, new checksum value will
not match stored data and corruption will be detected</li>
</ul></li>
<li>in writes:
<ul class="org-ul">
<li>if write overwrites an existing range on the chunk, need to verify
the first and last blocks of the range being overwritten</li>
<li>calculate new checksums based from previous checksum so that corruption
of unchanged areas will be detected</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org80c9151" class="outline-2">
<h2 id="org80c9151"><span class="section-number-2">3</span> 6 Measurements</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>1 master, two master replicas, 16 chunkservers, and 16 clients</li>
</ul>
</div>
</div>
<div id="outline-container-org58a310b" class="outline-2">
<h2 id="org58a310b"><span class="section-number-2">4</span> 6.1.1 Reads</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>random 4MB read from 320 GB file set</li>
<li>chunkservers only have 32 GB of memory, expect at most 10% hit rate</li>
<li>theoretical limit 125MB/s with 1Gbps link becomes saturated
<ul class="org-ul">
<li>12.5 MB/s per client when 100Mbps network interface gets saturated</li>
<li>observed 10MB/s when one client reading</li>
<li>aggregate read 94 MB/s for 16 readers</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga1a0488" class="outline-2">
<h2 id="orga1a0488"><span class="section-number-2">5</span> 6.1.2 Writes</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>1GB of data in 1MB writes</li>
<li>Limits at 67 MB/s because need to write each byte to 3 of the 16 chunkservers
each with a 12.5 MB/s input</li>
<li>write rate for one client is 6.3MB/s - delays in propagating data to replicas</li>
<li>aggregate 35MB/s for 16 clients, multiple clients writing concurrently to same
chunkservers</li>
</ul>
</div>
</div>
<div id="outline-container-orge255c21" class="outline-2">
<h2 id="orge255c21"><span class="section-number-2">6</span> 6.1.3 Appends</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>limited by BW of the chunkservers storing the last chunk of the file</li>
</ul>
</div>
</div>
<div id="outline-container-org92da799" class="outline-2">
<h2 id="org92da799"><span class="section-number-2">7</span> 6.2.4 Master Load</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>200-500 ops/s</li>
<li>master bottlenecs scanning through large directories looking for particular
files, change to binary seraches through namespace</li>
</ul>
</div>
</div>
<div id="outline-container-org8ef8a47" class="outline-2">
<h2 id="org8ef8a47"><span class="section-number-2">8</span> 6.2.5 Recovery time</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>experiment: kill chunkserver with 15,000 chunks 600GB of data</li>
<li>what does 91 concurrent clonings mean?</li>
</ul>
</div>
</div>
<div id="outline-container-org30ae72e" class="outline-2">
<h2 id="org30ae72e"><span class="section-number-2">9</span> 6.3.2 Chuckserver Workload</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge726718" class="outline-3">
<h3 id="orge726718"><span class="section-number-3">9.1</span> Bimodal</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>small reads &lt;64KB from seek-intensive clients</li>
<li>large reads &gt;512KB from long sequential reads</li>
<li>small writes for clients that checkpoint or sync more often</li>
<li>large writes for clients that do more buffering</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0213f30" class="outline-2">
<h2 id="org0213f30"><span class="section-number-2">10</span> 6.3.3 Appends vs Writes</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>100x more appends than writes</li>
<li>mutations are mostly appends and not overwriting</li>
</ul>
</div>
</div>
<div id="outline-container-orga488e8a" class="outline-2">
<h2 id="orga488e8a"><span class="section-number-2">11</span> 6.3.4 Master Workload</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>FindLocation - request for chunk locations (for reads)</li>
<li>FindLeaseLocker - lease holder information (for mutations)</li>
</ul>
</div>
</div>
<div id="outline-container-org108ddfd" class="outline-2">
<h2 id="org108ddfd"><span class="section-number-2">12</span> 7 Experiences</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgffa718e" class="outline-3">
<h3 id="orgffa718e"><span class="section-number-3">12.1</span> RW lock</h3>
<div class="outline-text-3" id="text-12-1">
<p>
lock blocked network thread while disk threads were paging in previously mapped
data, solution let threads read from a copy so that network thread is not blocked
</p>
</div>
</div>
</div>

<div id="outline-container-orgade7f9d" class="outline-2">
<h2 id="orgade7f9d"><span class="section-number-2">13</span> Summary</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orga237fd9" class="outline-3">
<h3 id="orga237fd9"><span class="section-number-3">13.1</span> design space</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>common failures</li>
<li>optimize for huge files</li>
<li>most append only and sequential reads</li>
</ul>
</div>
</div>
<div id="outline-container-org84a9dad" class="outline-3">
<h3 id="org84a9dad"><span class="section-number-3">13.2</span> fault tolerance</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>constant monitoring
<ul class="org-ul">
<li>checksum to detect data corruption</li>
</ul></li>
<li>replicating crucial data
<ul class="org-ul">
<li>chuck replication</li>
</ul></li>
<li>fast and automatic recovery
<ul class="org-ul">
<li>online repair system compensates for lost resplicas asap</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5bf5c67" class="outline-3">
<h3 id="org5bf5c67"><span class="section-number-3">13.3</span> high throughput</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li>separate file system control from data transfer</li>
<li>file system control handled by master</li>
<li>data transfer handled by chunkservers</li>
<li>master involvement is minimized
<ul class="org-ul">
<li>large chunk size</li>
<li>chunk leases - delegates authority to primary replicas</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-05-09T10:08:17-07:00</p>
<p class="author">Author: adam</p>
<p class="date">Created: 2020-05-09 Sat 11:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
